package jp.ne.tbs.control.FD01;

import jp.ne.tbs.frame.AA00.MAA00B007Z00;

/**
 * <p>[クラス名]</p>
 * 　　インフルエンザ予防接種希望集計　帳票編集コントロールクラス
 * <p>[概要]</p>
 * <p>[変更履歴]</p>
 * 　　2019/09/17　小嶋純史　新規作成
 */
public class MFD01B005Z00 extends MAA00B007Z00 {

	/**
	 * <p>[概 要] 帳票編集コントロールを実行する。</p>
	 * <p>[詳 細] 帳票編集コントロールを実装する</p>
	 * <p>[備 考] </p>
	 */
	public void execute() {

		//帳票出力CTL
		//①タイトル出力
		//②データ行出力(患者ID・名前・フリガナ・インフルエンザ希望str・家族ｎ名・続柄str・保険証撮影str・助成str・予診票保管場所・支払方法・ステータス)
		//③サマリ行出力

	}

}

